<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"ce8cf8e5a914284f17608a54498b84dcccf3f08b67dfb0b546bcc091ae0a7126","plan_job_ref":"Job Create Terraform plan (DEV) #84 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15019122373","plan_out_hash":"41cbd378325cc63c43d94f362758f269af25745fd7291bfc8641875f603b22a1","plan_hash":"f23a1ad66d2be83e9b60c00bc329844a4a352299ccdbd51d75761f0c257f225b","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 1 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be updated in-place
!~  resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.ContainerService/managedClusters/openmrs-dev-audioprothese-aks"
        name                                = "openmrs-dev-audioprothese-aks"
        tags                                = {
            "Environment"  = "dev"
            "organization" = "audioprothese"
            "project"      = "openmrs"
        }
#        (31 unchanged attributes hidden)

!~      default_node_pool {
            name                          = "default"
            tags                          = {}
#            (30 unchanged attributes hidden)

-           upgrade_settings {
-               drain_timeout_in_minutes      = 0 -> null
-               max_surge                     = "10%" -> null
-               node_soak_duration_in_minutes = 0 -> null
            }
        }

#        (4 unchanged blocks hidden)
    }

  # helm_release.alloy will be updated in-place
!~  resource "helm_release" "alloy" {
        id                         = "alloy"
        name                       = "alloy"
+       upgrade_install            = true
#        (28 unchanged attributes hidden)
    }

  # helm_release.loki will be updated in-place
!~  resource "helm_release" "loki" {
        id                         = "loki"
        name                       = "loki"
+       upgrade_install            = true
#        (28 unchanged attributes hidden)
    }

  # helm_release.openmrs will be updated in-place
!~  resource "helm_release" "openmrs" {
        id                         = "openmrs"
        name                       = "openmrs"
+       upgrade_install            = true
#        (28 unchanged attributes hidden)
    }

  # helm_release.prometheus-stack will be created
+   resource "helm_release" "prometheus-stack" {
+       atomic                     = false
+       chart                      = "kube-prometheus-stack"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "prometheus-stack"
+       namespace                  = "monitoring"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://prometheus-community.github.io/helm-charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       upgrade_install            = true
+       values                     = [
+           <<-EOT
                ---
                prometheus:
                  ingress:
                    enabled: true
                    ingressClassName: "webapprouting.kubernetes.azure.com"
                    annotations: {}
                    labels: {}
                    path: /
                    pathType: Prefix
                    hosts:
                      - prometheus.dev.audioprothese.duckdns.org
                  extraPaths: []
                  tls: []
                
                grafana:
                  adminUser: admin
                  adminPassword: password
                  ingress:
                    enabled: true
                    annotations: {}
                    labels: {}
                    path: /
                    pathType: Prefix
                    hosts:
                      - grafana.dev.audioprothese.duckdns.org
                    extraPaths: []
                    tls: []
                    ingressClassName: "webapprouting.kubernetes.azure.com"
                  datasources:
                    datasources.yaml:
                      apiVersion: 1
                      datasources:
                        - name: Loki
                          type: loki
                          url: http://loki-gateway.loki.svc.cluster.local/
            EOT,
        ]
+       verify                     = false
+       version                    = "72.3.1"
+       wait                       = true
+       wait_for_jobs              = false
    }

Plan: 1 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #84](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15019122373)